app/controllers/api/v1/user_management/student/student_enrolls_controller.rb

  def update
    if board_params.present?
      @student_enroll.update_column(:board_id, params[:board_id])
      render json:@student_enroll, status: :created
    end

    if class_params.present?
      @student_enroll.update_column(:s_class_id, params[:class_id])
---
UPDATE "student_enrolls" SET "board_id" = $1 WHERE "student_enrolls"."id" = $2  [["board_id", 1], ["id", 1]]
UPDATE "student_enrolls" SET "s_class_id" = $1 WHERE "student_enrolls"."id" = $2  [["s_class_id", 1], ["id", 1]]

    def set_student_enroll
      @current_user = current_user
      @student_enroll = StudentEnroll.find_by(id: @current_user.id)
---
SELECT "student_enrolls".* FROM "student_enrolls" WHERE "student_enrolls"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]