app/controllers/api/v1/user_management/student/student_enrolls_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."b_name" = $1 LIMIT $2  [["b_name", "ICSE"], ["LIMIT", 1]]
SELECT "s_classes".* FROM "s_classes" WHERE "s_classes"."class_no" = $1 LIMIT $2  [["class_no", 10], ["LIMIT", 1]]
---
  def update
    if board_params.present?
      @board = Board.find_by(b_name: params[:board])
      @student_enroll.update_column(:board_id, @board.id)
      render json: {status:"board has been updated", details:{student_id: @student_enroll.student_id, board_id: @student_enroll.board_id }}, status: :no_content
    end

    if class_params.present?
      @class_no = SClass.find_by(class_no: params[:class])