app/controllers/api/api_controller.rb

    def current_user
        token = request.headers['Authorization'].presence
        if token
         @current_user ||= Student.find_by(id: doorkeeper_token[:resource_owner_id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]