app/controllers/api/v1/user_management/student/content_management/user_contents_controller.rb

SELECT "user_contents".* FROM "user_contents" WHERE "user_contents"."student_enroll_id" = $1 AND "user_contents"."content_id" = $2 LIMIT $3  [["student_enroll_id", 1], ["content_id", 1], ["LIMIT", 1]]
UPDATE "user_contents" SET "upvote" = $1 WHERE "user_contents"."id" = $2  [["upvote", true], ["id", 1]]
UPDATE "user_contents" SET "downvote" = $1 WHERE "user_contents"."id" = $2  [["downvote", false], ["id", 1]]
---
  def upvote
    @user_content = @student_enroll.user_contents.find_by(content_id: params[:content_id])
    @user_content.update_column(:upvote, "true")
    @user_content.update_column(:downvote, "false")

SELECT "user_contents".* FROM "user_contents" WHERE "user_contents"."student_enroll_id" = $1 AND "user_contents"."content_id" = $2 LIMIT $3  [["student_enroll_id", 1], ["content_id", 1], ["LIMIT", 1]]
---
  def content_details
    @user_content = @student_enroll.user_contents.find_by(content_id: params[:content_id])

SELECT "student_enrolls".* FROM "student_enrolls" WHERE "student_enrolls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_student_enroll
      @current_user = current_user
      @student_enroll = StudentEnroll.find_by(id: @current_user.id)

SELECT "user_contents".* FROM "user_contents" WHERE "user_contents"."student_enroll_id" = $1 AND "user_contents"."content_id" = $2 LIMIT $3  [["student_enroll_id", 1], ["content_id", 1], ["LIMIT", 1]]
INSERT INTO "user_contents" ("upvote", "downvote", "notes", "content_id", "student_enroll_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create_user_content
      unless @student_enroll.user_contents.find_by(content_id: params[:content_id]).present?
        @student_enroll.user_contents.create!(upvote: false, downvote: false, notes: "",status: 'started', content_id: params[:content_id],student_enroll_id: @student_enroll.student_id)