app/controllers/api/v1/user_management/student/exercise_management/attempts_controller.rb

  def index

    @attempts = Attempt.where(:student_enroll_id => @student_enroll.id, :exercise_id => @exercise.id)
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."student_enroll_id" = $1 AND "attempts"."exercise_id" = $2  [["student_enroll_id", 1], ["exercise_id", 1]]

  def update
    @attempt.update_column(:finished_at, DateTime.now)
    @attempt.update_column(:score,QnResponse.where(:attempt_id => @attempt.id).sum(:score) )
    attempt_no = @exercise.attempts_no.to_i + 1
    @exercise.update_column(:attempts_no, attempt_no)
    highscore = Attempt.where(:student_enroll_id => @student_enroll.id, :exercise_id => @exercise.id).maximum(:score)
    @exercise.update_column(:high_score, highscore)
---
UPDATE "attempts" SET "finished_at" = $1 WHERE "attempts"."id" = $2  [["finished_at", "2022-07-13 04:13:37.997817"], ["id", 5]]
SELECT SUM("qn_responses"."score") FROM "qn_responses" WHERE "qn_responses"."attempt_id" = $1  [["attempt_id", 5]]
UPDATE "attempts" SET "score" = $1 WHERE "attempts"."id" = $2  [["score", 0], ["id", 5]]
UPDATE "exercises" SET "high_score" = $1 WHERE "exercises"."id" = $2  [["high_score", nil], ["id", 2]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."student_enroll_id" = $1 AND "attempts"."exercise_id" = $2 ORDER BY "attempts"."id" DESC LIMIT $3  [["student_enroll_id", 1], ["exercise_id", 2], ["LIMIT", 1]]
SELECT MAX("attempts"."score") FROM "attempts" WHERE "attempts"."student_enroll_id" = $1 AND "attempts"."exercise_id" = $2  [["student_enroll_id", 1], ["exercise_id", 2]]
UPDATE "exercises" SET "high_score" = $1 WHERE "exercises"."id" = $2  [["high_score", 0], ["id", 2]]

  def create
    if @attempt.present?
      check_val=@attempt.finished_at
      if check_val.nil?
        render json: {message:"Previous attempt has not been finished", attempt_id: @attempt.id}, status: :unprocessable_entity
      else
        @attempt_new = @student_enroll.attempts.create!(attempted_at: DateTime.now, exercise_id: @exercise.id )
        render json: @attempt_new, status: :created
      end
    else
      @attempt_new = @student_enroll.attempts.create!(attempted_at: DateTime.now, exercise_id: @exercise.id )
---
INSERT INTO "attempts" ("score", "attempted_at", "finished_at", "exercise_id", "student_enroll_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_attempt
      @attempt_inst = Attempt.where(:student_enroll_id => @student_enroll.id, :exercise_id => @exercise.id).last
      @attempt = Attempt.find_by(id: @attempt_inst.id)
---
SELECT "attempts".* FROM "attempts" WHERE "attempts"."student_enroll_id" = $1 AND "attempts"."exercise_id" = $2 ORDER BY "attempts"."id" DESC LIMIT $3  [["student_enroll_id", 1], ["exercise_id", 2], ["LIMIT", 1]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def set_exercise
      @exercise = Exercise.find_by(id: params[:exercise_id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def set_student_enroll
      @current_user = current_user
      @student_enroll = StudentEnroll.find_by(id: @current_user.id)
---
SELECT "student_enrolls".* FROM "student_enrolls" WHERE "student_enrolls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]