app/controllers/api/v1/user_management/student/exercise_management/qn_responses_controller.rb

UPDATE "qn_responses" SET "selected_option" = $1, "updated_at" = $2 WHERE "qn_responses"."id" = $3  [["selected_option", "B"], ["updated_at", "2022-07-11 17:43:59.567550"], ["id", 1]]
UPDATE "qn_responses" SET "score" = $1 WHERE "qn_responses"."id" = $2  [["score", 1], ["id", 1]]
UPDATE "qn_responses" SET "score" = $1 WHERE "qn_responses"."id" = $2  [["score", 0], ["id", 1]]
INSERT INTO "qn_responses" ("selected_option", "marked_for_review", "score", "question_id", "attempt_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if @qn_response.present?
      @qn_response.update(qn_response_params)
      if @option.opt_status == "correct"
        @qn_response.update_column(:score, 1)
      else
        @qn_response.update_column(:score,0)
      end
      render json: @qn_response, status: :created
    else
      @qn_response_new = @attempt.qn_responses.create!(qn_response_params)

SELECT "attempts".* FROM "attempts" WHERE "attempts"."student_enroll_id" = $1 AND "attempts"."exercise_id" = $2 ORDER BY "attempts"."id" DESC LIMIT $3  [["student_enroll_id", 1], ["exercise_id", 1], ["LIMIT", 1]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_attempt
      @attempt_inst = Attempt.where(:student_enroll_id => @student_enroll.id, :exercise_id => @exercise.id).last
      @attempt = Attempt.find_by(id: @attempt_inst.id)

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_exercise
      @exercise = Exercise.find_by(id: params[:exercise_id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_question
      @question = Question.find_by(id: params[:question_id])

SELECT "student_enrolls".* FROM "student_enrolls" WHERE "student_enrolls"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]
---
    def set_student_enroll
      @current_user = current_user
      @student_enroll = StudentEnroll.find_by(id: @current_user.id)

SELECT "qn_responses".* FROM "qn_responses" WHERE "qn_responses"."attempt_id" = $1 AND "qn_responses"."question_id" = $2 ORDER BY "qn_responses"."id" ASC LIMIT $3  [["attempt_id", 3], ["question_id", 1], ["LIMIT", 1]]
---
    def set_qn_response
      @qn_response_inst = QnResponse.where(:attempt_id => @attempt.id, :question_id => @question.id).first

SELECT "options".* FROM "options" WHERE "options"."question_id" = $1 AND "options"."option_name" = $2 ORDER BY "options"."id" ASC LIMIT $3  [["question_id", 1], ["option_name", "B"], ["LIMIT", 1]]
---
    def set_option
      @option_inst =Option.where(:question_id => params[:question_id],:option_name => params[:selected_option]).first