app/controllers/api/v1/boards_controller.rb

INSERT INTO "boards" ("b_name", "b_desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["b_name", "CBSE"], ["b_desc", "Central Board of secondary education"], ["created_at", "2022-06-30 06:44:18.998153"], ["updated_at", "2022-06-30 06:44:18.998153"]]
---
  def create
    @board = Board.new(board_params)

    if @board.save

UPDATE "boards" SET "b_name" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["b_name", "ICSE"], ["updated_at", "2022-06-30 06:44:57.348861"], ["id", 1]]
---
  def update
    if @board.update(board_params)