app/controllers/api/v1/s_classes_controller.rb

  def index
    @s_classes = SClass.all
---
SELECT "s_classes".* FROM "s_classes"

  def create
    @s_class = SClass.new(s_class_params)

    if @s_class.save
---
INSERT INTO "s_classes" ("class_no", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["class_no", 10], ["created_at", "2022-06-30 14:58:26.985302"], ["updated_at", "2022-06-30 14:58:26.985302"]]