app/controllers/api/v1/subjects_controller.rb

SELECT "subjects".* FROM "subjects" WHERE "subjects"."s_class_id" IS NULL AND "subjects"."board_id" IS NULL
---
  def index
    @subjects = Subject.where(:s_class_id => params[:s_class_id], :board_id => params[:board_id])

INSERT INTO "subjects" ("s_name", "s_logo", "s_class_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["s_name", "Physics"], ["s_logo", nil], ["s_class_id", 1], ["board_id", 1], ["created_at", "2022-07-05 04:13:53.026764"], ["updated_at", "2022-07-05 04:13:53.026764"]]
---
  def create
    @subject = Subject.new(:s_name => params[:s_name], :s_class_id => params[:s_class_id], :board_id =>  params[:board_id] )

    if @subject.save