app/controllers/api/v1/user_management/student/auth/registrations_controller.rb

   def create
       if params[:username].blank? || params[:email].blank? || params[:password].blank? || params[:password_confirmation].blank? || params[:ph_no].blank?
            render json: {status: "failed", message: "Missing parameters"}, status: :unprocessable_entity
       else
            @student = Student.new(user_params)
            if @student.save
               @student.create_student_enroll!(otp: "1234", otp_generated_at: DateTime.now)
                  render json: {status: "successful", id: @student.id, email: @student.email, created_at: @student.created_at, updated_at: @student.updated_at }
---
INSERT INTO "students" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "username", "auth_token", "ph_no", "dob") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
INSERT INTO "student_enrolls" ("otp", "otp_generated_at", "student_id", "board_id", "s_class_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

   def check_user
        if Student.exists?(email: params[:email])
---
SELECT 1 AS one FROM "students" WHERE "students"."email" = $1 LIMIT $2  [["email", "cheems@gmail.com"], ["LIMIT", 1]]