app/controllers/api/v1/user_management/student/auth/sessions_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email" = $1 ORDER BY "students"."id" ASC LIMIT $2  [["email", "cheemsa@gmail.com"], ["LIMIT", 1]]
INSERT INTO "oauth_access_tokens" ("resource_owner_id", "token", "refresh_token", "expires_in", "revoked_at", "created_at", "scopes", "previous_refresh_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "students" SET "sign_in_count" = $1, "current_sign_in_at" = $2, "last_sign_in_at" = $3, "updated_at" = $4 WHERE "students"."id" = $5  [["sign_in_count", 3], ["current_sign_in_at", "2022-06-29 13:57:25.874200"], ["last_sign_in_at", "2022-06-29 13:56:56.597607"], ["updated_at", "2022-06-29 13:57:25.874411"], ["id", 3]]
---
    def create
           resource = Student.find_for_database_authentication(email: params[:email])
           return invalid_login_attempt unless resource
           if resource.valid_password?(params[:password])
                 sign_in("user", resource)
                 access_token = Doorkeeper::AccessToken.create(
                  resource_owner_id: resource.id,
                  refresh_token: generate_refresh_token,
                  expires_in: Doorkeeper.configuration.access_token_expires_in.to_i,
                  scopes: ''
                )
                 render json: {status:"successful", user: { id: resource.id, email: resource.email,  auth_token: access_token.token, created_at: resource.created_at, updated_at: resource.updated_at }}

SELECT 1 AS one FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."refresh_token" = $1 LIMIT $2  [["refresh_token", "[FILTERED]"], ["LIMIT", 1]]
---
      def generate_refresh_token
            loop do
                 token = SecureRandom.hex(32)
                 break token unless Doorkeeper::AccessToken.exists?(refresh_token: token)