app/controllers/api/v1/meta/boards_controller.rb

INSERT INTO "boards" ("b_name", "b_desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["b_name", "ICSE"], ["b_desc", "Indian Certificate of Secondary Education"], ["created_at", "2022-07-12 17:21:37.191850"], ["updated_at", "2022-07-12 17:21:37.191850"]]
---
  def create
    @board = Board.new(board_params)

    if @board.save