app/controllers/api/v1/meta/chapters_controller.rb

  def create
    @subject.chapters.create!(chapter_params)
---
INSERT INTO "chapters" ("c_name", "pdf_no", "video_no", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["c_name", "Electrostaticity"], ["pdf_no", 3], ["video_no", 15], ["subject_id", 1], ["created_at", "2022-07-12 17:23:11.675214"], ["updated_at", "2022-07-12 17:23:11.675214"]]

    def set_subject
      @subject = Subject.find(params[:subject_id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_chapter
      @chapter = @subject.chapters.find_by!(id: params[:id])
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."subject_id" = $1  [["subject_id", 2]]