app/controllers/api/v1/meta/contents_controller.rb

  def create
    @chapter.contents.create!(content_params)
---
INSERT INTO "contents" ("content", "link", "chapter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "video"], ["link", "www.fdsfdsf.com"], ["chapter_id", 1], ["created_at", "2022-07-12 17:24:10.707261"], ["updated_at", "2022-07-12 17:24:10.707261"]]