app/controllers/api/v1/meta/exercises_controller.rb

  def create
    @chapter.exercises.create!(exercise_params)
---
INSERT INTO "exercises" ("title", "duration", "qn_no", "attempts_no", "high_score", "instructions", "chapter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def set_exercise
    @exercise = @chapter.exercises.find_by!(id: params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."chapter_id" = $1  [["chapter_id", 3]]