app/controllers/api/v1/meta/options_controller.rb

  def create
    @option_new = @question.options.create!(option_params)
---
INSERT INTO "options" ("option_name", "option", "opt_status", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["option_name", "A"], ["option", "lorem ipsum"], ["opt_status", "wrong"], ["question_id", 1], ["created_at", "2022-07-11 17:25:31.862502"], ["updated_at", "2022-07-11 17:25:31.862502"]]