app/controllers/api/v1/meta/questions_controller.rb

  def create
    @question = @exercise.questions.create!(question_params)
---
INSERT INTO "questions" ("qn_no", "question", "duration", "exercise_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["qn_no", 1], ["question", "Lorem Ipsum"], ["duration", "2022-07-11 12:00:00"], ["exercise_id", 1], ["created_at", "2022-07-11 17:08:47.832737"], ["updated_at", "2022-07-11 17:08:47.832737"]]