app/controllers/api/v1/meta/s_classes_controller.rb

  def create
    @s_class = @board.s_classes.create!(s_class_params)

    if @s_class.save
---
INSERT INTO "s_classes" ("class_no", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["class_no", 10], ["board_id", 1], ["created_at", "2022-07-13 12:51:33.632184"], ["updated_at", "2022-07-13 12:51:33.632184"]]
INSERT INTO "s_classes" ("class_no", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["class_no", 11], ["created_at", "2022-07-12 17:21:47.590146"], ["updated_at", "2022-07-12 17:21:47.590146"]]

    def set_board
      @board = Board.find_by(id: params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_s_class
      @s_class = @board.s_classes.find_by!(id: params[:id])
---
SELECT "s_classes".* FROM "s_classes" WHERE "s_classes"."board_id" = $1  [["board_id", 1]]