app/controllers/api/v1/meta/subjects_controller.rb

  def create
    @subject = @s_class.subjects.create!(subject_params)

    if @subject.save
---
INSERT INTO "subjects" ("s_name", "s_logo", "s_class_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["s_name", "Maths"], ["s_logo", nil], ["s_class_id", 1], ["created_at", "2022-07-13 13:00:18.659026"], ["updated_at", "2022-07-13 13:00:18.659026"]]
INSERT INTO "subjects" ("s_name", "s_logo", "s_class_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["s_name", "Maths"], ["s_logo", nil], ["s_class_id", 1], ["board_id", 1], ["created_at", "2022-07-12 17:22:53.711327"], ["updated_at", "2022-07-12 17:22:53.711327"]]

    def set_s_class
      @s_class = SClass.find_by(id: params[:s_class_id])
---
SELECT "s_classes".* FROM "s_classes" WHERE "s_classes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_subject
      @subject = @s_class.subjects.find_by!(id: params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."s_class_id" = $1  [["s_class_id", 1]]